1)
//выведите в консоли полную дату
const d = new Date(2018,12,31,12,21,30)
console.log(d)

2)
//задайте и выведите в консоли только год, месяц, день

3)
//задайте и выведите в консоли только год, месяц, день, часы
const d = new Date(2018,12,31,12)
console.log(d)
4)
//задайте и выведите в консоли только год, месяц, день, часы, минуты
const d = new Date(2018,12,31,12,21)
console.log(d)
5)
//задайте и выведите в консоли только год, месяц, день, часы, минуты, секунды
const d = new Date(2018,12,31,12,21,22)
console.log(d)
6)
//напиши краткие форматы дат
"03/15/2021"
7)
//напиши длинные форматы дат
"15 mar 2025"
